<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"tts-10x-forms-dev","backend":"76878e7eced5aca878747ff2bd50844ffd3e7dfc6223c28a6e9fc33dfcd2ed1c","plan_job_ref":"Job Post Terraform plan to PR comment #608 at https://github.com/GSA-TTS/forms/actions/runs/12777237287","plan_out_hash":"ea60a0f1232c29bcc03520294c20657a355a0e4db3e1e86a5a0f92212103fd1d","plan_hash":"f912726ad9a66eecb26a2205e3c3879783981b206604c79374df52f6680e7686","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan for __tts-10x-forms-dev__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-forms-dev-server-doj_tts-10x-forms-dev-server-doj-app_22D74DC4 will be created
+   resource "cloudfoundry_app" "tts-10x-forms-dev-server-doj_tts-10x-forms-dev-server-doj-app_22D74DC4" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/server-doj:72e07fb1babf49f8815272929b801ee7795c3f34"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-forms-dev-server-doj-app"
+       ports                           = (known after apply)
+       space                           = "95f25610-2fa4-4e67-b5b1-aa9e3b7f5edf"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "a5a2085e-dbf6-43a2-ad92-7ac4a06d1fc0"
        }

+       service_binding {
+           service_instance = "4c335cfb-7eb1-48a4-bc13-f30cb351f3cf"
        }
+       service_binding {
+           service_instance = "5b76582e-ab6e-45fc-abcc-1bbee840a5e1"
        }
    }

  # cloudfoundry_app.tts-10x-forms-dev-server-kansas_tts-10x-forms-dev-server-kansas-app_6E2DB37A will be created
+   resource "cloudfoundry_app" "tts-10x-forms-dev-server-kansas_tts-10x-forms-dev-server-kansas-app_6E2DB37A" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/server-kansas:72e07fb1babf49f8815272929b801ee7795c3f34"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-forms-dev-server-kansas-app"
+       ports                           = (known after apply)
+       space                           = "95f25610-2fa4-4e67-b5b1-aa9e3b7f5edf"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 60

+       routes {
+           port  = (known after apply)
+           route = "31e71ca1-7f0a-4314-97aa-292d2614bebd"
        }

+       service_binding {
+           service_instance = "94d26df1-7d46-4d14-b861-39259ac2d345"
        }
+       service_binding {
+           service_instance = "dbcb7300-afb1-4ffc-af5e-d3caa8991c45"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Post Terraform plan to PR comment #608](https://github.com/GSA-TTS/forms/actions/runs/12777237287)